Repository: 84000/data-translation-memory
Catalog: Toh_147-The_Teaching_on_the_Great_Compassion_of_the_Tathagata-v1.tmx
Source language: bo
Languages: en

source: དྲི་མེད་མིག་གིས་མ་འོངས་དུས་ན་ནི། །ཆུང་ཟད་འབྱུང་བར་འགྱུར་དང་འཇིག་འགྱུར་དང་། །སངས་རྒྱས་ཞིང་རྣམས་ཀུན་ན་རྒྱལ་བ་དང་། །དེ་དག་ཐམས་ཅད་མ་ལུས་སངས་རྒྱས་མཁྱེན། །
en: “ ‘With their stainless vision, The buddhas are fully aware Of any event that will appear and disappear in the future, As well as each and every victor throughout the buddhafields.

source: མ་འོངས་པ་ཡི་དམིགས་པར་གཏོང་བ་ན། །
en: “ ‘As they set their sights upon future events,

source: དེ་ཡི་སེམས་ནི་ནམས་ཀྱང་གཡེང་བ་མེད། །
en: Their minds are never distracted.

source: སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་ཆོས་སྟོན་ཏེ། །
en: They teach beings the Dharma accordingly.

source: འདི་ནི་རྐང་གཉིས་མཆོག་གི་འཕྲིན་ལས་ཡིན། །
en: This is the liberating activity of the supreme beings.’

source: རིགས་ཀྱི་བུ་གཞན་ཡང་ད་ལྟར་བྱུང་བའི་དུས་ལ་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་མཐོང་བ་ཆགས་པ་མེད་ཅིང་ཐོགས་པ་མེད་པ་འཇུག་གོ། །
en: (32) “Furthermore, son of noble family, the tathāgatas’ vision of wisdom has unattached and unobstructed access to the present.

source: འདི་ལ་དེ་བཞིན་གཤེགས་པས་ཕྱོགས་བཅུ་དག་ན་ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་བགྲང་བ་རྣམ་པ་གསུམ་གྱི་ཚུལ་གྱིས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The tathāgatas know in a threefold manner the number of all the present buddhafields in the ten directions.

source: ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་ཐམས་ཅད་རབ་ཏུ་མཁྱེན་ཏོ། །ད་ལྟར་བྱུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་རབ་ཏུ་མཁྱེན་ཏོ། །ད་ལྟར་བྱུང་བའི་ཉན་ཐོས་ཐམས་ཅད་རབ་ཏུ་མཁྱེན་ཏོ། །ད་ལྟར་བྱུང་བའི་རང་སངས་རྒྱས་ཐམས་ཅད་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know all the present buddhas, all of the present bodhisattvas, all of the present śrāvakas, and all of the present pratyekabuddhas.

source: ད་ལྟར་བྱུང་བའི་སྐར་མའི་གཟུགས་ཐམས་ཅད་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “They know all the present constellations of stars.

source: ད་ལྟར་བྱུང་བའི་རྩྭ་དང་། ཤིང་གེལ་པ་དང་། སྨན་དང་། ནགས་ཚལ་རྣམས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know the present blades of grass, bushes, herbs, and forests.

source: ཕྱོགས་བཅུ་དག་ན་ད་ལྟར་བྱུང་བའི་སའི་ཁམས་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་གྱི་ཆར་བརླགས་པ་ཐམས་ཅད་བགྲང་བའི་ཚུལ་གྱིས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know numerically all the dust particles of the earth element being crushed into pieces right now in the ten directions.

source: ཕྱོགས་བཅུའི་ཆུའི་ཁམས་སྐྲའི་རྩེ་མོས་བླངས་པའི་ཐིགས་པ་ཐམས་ཅད་ཀྱང་བགྲང་བའི་ཚུལ་གྱིས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know numerically all the minutest drops of the water element in the ten directions.

source: ཕྱོགས་བཅུའི་མེའི་ཁམས་ཀྱི་སྐྱེ་བ་དང་འགག་པ་ཐམས་ཅད་ཀྱང་བགྲང་བའི་ཚུལ་གྱིས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know numerically all the sparks of the fire element flickering in the ten directions.

source: ཕྱོགས་བཅུའི་རླུང་གི་ཁམས་ཐམས་ཅད་ཀྱང་གཟུགས་སུ་གྱུར་པ་ལ་བབ་པའི་ཚུལ་གྱིས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know numerically all the gusts of wind forming in the ten directions.

source: ཕྱོགས་བཅུའི་ནམ་མཁའི་ཁམས་ཐམས་ཅད་ཀྱང་སྐྲའི་རྩེ་མོས་རྒྱས་པར་དགང་བའི་ཚུལ་གྱིས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know numerically all the minutest extensions of space in the ten directions.

source: ད་ལྟར་བྱུང་བའི་སེམས་ཅན་གྱི་ཁམས་རྣམ་པ་གསུམ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “They know the three aspects of the realms of beings in the present:

source: ད་ལྟར་བྱུང་བའི་སེམས་ཅན་དམྱལ་བ་པའི་སེམས་ཅན་གྱི་ཁམས་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། །དེའི་སྐྱེ་བའི་རྒྱུ་དང་ཐར་པའི་རྒྱུ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know the realms of beings currently dwelling in hell, the causes of their birth, and the causes of their liberation.

source: ད་ལྟར་བྱུང་བའི་དུད་འགྲོའི་སྐྱེ་གནས་སུ་སོང་བའི་སེམས་ཅན་གྱི་ཁམས་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། །དེའི་སྐྱེ་བའི་རྒྱུ་དང་ཐར་པའི་རྒྱུ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know the realms of beings currently reborn as animals, the causes of their birth, and the causes of their liberation.

source: ད་ལྟར་བྱུང་བའི་གཤིན་རྗེའི་འཇིག་རྟེན་པའི་སེམས་ཅན་གྱི་ཁམས་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། །དེའི་སྐྱེ་བའི་རྒྱུ་དང་ཐར་པའི་རྒྱུ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know the realms of beings currently in the world of Yama, the causes of their birth, and the causes of their liberation.

source: ད་ལྟར་བྱུང་བའི་མིར་གྱུར་པའི་སེམས་ཅན་གྱི་ཁམས་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། །དེའི་སྐྱེ་བའི་རྒྱུ་དང་ཐར་པའི་རྒྱུ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know the realms of beings who have become human, the causes of their birth, and the causes of their liberation.

source: ད་ལྟར་བྱུང་བའི་ལྷའི་སེམས་ཅན་གྱི་ཁམས་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། །དེའི་སྐྱེ་བའི་རྒྱུ་དང་ཐར་པའི་རྒྱུ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know the realms of beings who are currently gods, the causes of their birth, and the causes of their liberation.

source: ད་ལྟར་བྱུང་བའི་སེམས་ཅན་རྣམས་ཀྱི་སེམས་ཀྱི་རྒྱུན་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། །དེ་དག་ཉོན་མོངས་པ་དང་བཅས་པ་དང་། ཉོན་མོངས་པ་དང་བྲལ་བ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know the mindstreams of present sentient beings, their afflictive emotions, and their lack of afflictive emotions.

source: ད་ལྟར་བྱུང་བའི་སེམས་ཅན་གདུལ་བར་འོས་པ་རྣམས་ཀྱི་དབང་པོ་རྣམས་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know the faculties of present beings fit to be tamed and those who are not fit to be tamed.

source: གདུལ་བར་འོས་པ་མ་ཡིན་པ་དག་གི་དབང་པོ་རྣམས་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། །དེ་བཞིན་གཤེགས་པས་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཀྱང་དེ་བཞིན་གཤེགས་པ་ལ་གཉིས་ཀྱི་རྗེས་སུ་འབྲང་བའི་རྣམ་པར་ཤེས་པ་མེད་ཅིང་གཉིས་སུ་མེད་པ་ལ་གཟུད་པའི་ཕྱིར་སེམས་ཅན་རྣམས་ལ་ཆོས་ཀྱང་སྟོན་ཏེ
en: “Even though the tathāgatas know in this manner, they have no consciousness that pursues dualities, and they teach the Dharma to beings in order to introduce them to nonduality.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་སུམ་ཅུ་རྩ་གཉིས་པའོ། །
en: This is the thirty-second tathāgata activity of the tathāgatas.

source: རྒྱལ་བ་རྣམས་ཀྱི་སྤྱོད་ཡུལ་ཐུག་པ་མེད། །
en: “ ‘The sphere of activity of the victors is infinite.

source: ཚད་མེད་གཞལ་དུ་མེད་ཅིང་བསམ་མི་ཁྱབ། །
en: It is immeasurable, unfathomable, and inconceivable,

source: ནམ་མཁའ་མཚུངས་ཤིང་དཔེ་ཡང་མེད་པ་སྟེ། །
en: Equal to space and beyond compare.

source: འགྲོ་བ་ཀུན་གྱིས་ཤེས་པར་མི་ནུས་སོ། །
en: No one is capable of knowing it.

source: ཕྱོགས་བཅུ་དག་ན་ད་ལྟར་བྱུང་བ་ཡི། །འགྲོ་བའི་བྱ་བར་གྱུར་པ་ཇི་སྙེད་པ། །དེ་དག་ཐམས་ཅད་རྒྱལ་བས་རྗེས་སུ་མཁྱེན། །
en: “ ‘The victors know fully Each and every action performed by beings In the present moment, throughout the ten directions.

source: འདི་ནི་རང་བྱུང་རྣམས་ཀྱི་ལས་ཀྱི་མཆོག །
en: This is the supreme activity of the spontaneously arisen ones.’

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་ནི་སུམ་ཅུ་རྩ་གཉིས་པོ་འདི་དག་སྟེ།
en: “Son of noble family, these are the thirty-two tathāgata activities.

source: དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་དེ་དག་དང་ལྡན་པས་སེམས་ཅན་གྱི་ཁམས་འདུལ་ལོ། །
en: With these the tathāgatas tame the masses of beings.

source: དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་ནི་ཚད་མེད་མོད་ཀྱི། སེམས་ཅན་རྣམས་གཟུད་པའི་ཕྱིར་མདོ་ཙམ་དུ་ཚད་ཀྱིས་བསྟན་ཏོ།། །།
en: Even though the tathāgata activities are immeasurable, they are presented in abbreviated form in order to guide beings.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་གང་ཡིན་པ་དེ་ནི་ཚད་མེད་པའོ། །
en: “Son of noble family, the tathāgata activity of the tathāgatas is immeasurable.

source: བསམ་གྱིས་མི་ཁྱབ་པའོ། །
en: It is inconceivable.

source: འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་ཤེས་པར་བྱ་བ་མ་ཡིན་པའོ། །ཡི་གེ་རྣམས་ཀྱིས་བརྗོད་པར་བྱ་བ་མ་ཡིན་པའོ། །གཞན་དག་གིས་ཐོབ་པར་དཀའ་བའོ། །
en: It remains unknowable to the whole world, indescribable by language, and hard for others to achieve.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་རྒྱུན་ཆད་པ་མེད་པའོ། །སངས་རྒྱས་ཐམས་ཅད་དང་མཉམ་པ་ཉིད་དུ་རྗེས་སུ་སོང་བའོ། །འབད་པའི་བྱ་བ་ཐམས་ཅད་ལས་ཤིན་ཏུ་འདས་པའོ། །
en: It exists unceasingly in all buddhafields, conforms equally to all buddhas, and completely transcends all efforts.

source: ནམ་མཁའ་དང་མཉམ་པ་ཉིད་པས་རྣམ་པར་མི་རྟོག་པའོ། །
en: It is nonconceptual since it is equal to space.

source: ཆོས་ཀྱི་དབྱིངས་ཀྱི་བྱ་བ་མ་ཡིན་པས་སྣ་ཚོགས་སུ་བྱར་མེད་པའོ། །
en: Since it is the action of the realm of phenomena, it does not act in a differentiated way.

source: རིགས་ཀྱི་བུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་གཏམ་སྣ་ཚོགས་ཀྱི་ཆེད་དུ་འབྱུང་བ་མ་ཡིན་ཏེ།
en: Son of noble family, the blessed buddhas do not appear in order to deliver differentiated discourses.

source: སེམས་ཅན་སྣ་ཚོགས་ཀྱི་གཏམ་གྱི་ཕྱིར་མ་ཡིན། ཞིང་སྣ་ཚོགས་ཀྱི་གཏམ་གྱི་ཕྱིར་མ་ཡིན། བསྟན་པ་སྣ་ཚོགས་ཀྱི་གཏམ་གྱི་ཕྱིར་མ་ཡིན། བསམ་པ་སྣ་ཚོགས་ཀྱི་གཏམ་གྱི་ཕྱིར་མ་ཡིན། རྣམ་པར་གྲོལ་བ་སྣ་ཚོགས་ཀྱི་གཏམ་གྱི་ཕྱིར་མ་ཡིན། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་སྣ་ཚོགས་ཀྱི་གཏམ་གྱི་ཕྱིར་མ་ཡིན་གྱི།
en: Nor, indeed, do they appear in order to deliver discourses that differentiate beings, buddhafields, dharmas, intentions, liberations, or types of nirvāṇa.

source: དེ་བཞིན་གཤེགས་པ་ནི་ཆོས་ཀྱི་དབྱིངས་རོ་གཅིག་པ། སྒྲིབ་པ་མེད་པ། སེམས་ཅན་ཐམས་ཅད་ལ་གོ་སྐབས་འབྱེད་པ། མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སེམས་ཅན་རྣམས་ཆོས་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་སྒྲིབ་པ་མེད་པའི་ཆོས་ཀྱི་འཁོར་ལོ་འདི་ལྟ་སྟེ། ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་རོ། །
en: Rather, upon attaining complete and perfect buddhahood, the tathāgatas—who are of one taste with the realm of phenomena, who are unobstructed, and who provide opportunity to all beings—set in motion the unobstructed wheel of the Dharma—the irreversible wheel of the Dharma—so that beings may comprehend the Dharma.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ནོར་བུ་མཁན་མཁས་པ་ནོར་བུ་སྦྱང་བའི་ཆོ་ག་ཤིན་ཏུ་ཤེས་པ་དེས་ནོར་བུའི་རིགས་ལས་སྦྱང་བ་མ་བྱས་པའི་ནོར་བུ་རིན་པོ་ཆེ་བླངས་ནས་
en: “Consider, son of noble family, the analogy of an expert jeweler who knows the procedure for purifying gems.

source: བུལ་ཐོག་གི་ཆུ་རྣོན་པོས་བཀྲུས་ཏེ།
en: He picks out a rough gem from a mine and rinses it in a strong soda solution.

source: སྐྲ་ནག་པོའི་ལ་བས་བྱི་དོར་བྱ་བས་བྱི་དོར་བྱེད་ཀྱང་དེ་ཙམ་གྱིས་བརྩོན་འགྲུས་རྒྱུན་མི་གཅོད་ཀྱི།
en: He then polishes it with a cloth made of black hair. But his efforts do not stop there.

source: དེའི་འོག་ཏུ་དངུལ་ཆུ་རྣོན་པོ་དང་བཅས་པས་བཀྲུས་ཏེ། ཤིང་དང་སྣམ་བུས་བྱི་དོར་བྱ་བས་བྱི་དོར་བྱེད་དོ། །
en: Next he rinses the gem in a strong quicksilver solution and polishes it with sawdust and woolen cloth.

source: དེ་ཙམ་གྱིས་ཀྱང་བརྩོན་འགྲུས་རྒྱུན་མི་གཅོད་དེ།
en: But his efforts do not stop there.

source: དེའི་འོག་ཏུ་ཡང་སྨན་ཆེན་པོའི་ཁུ་བས་བཀྲུས་ཏེ། རས་ཕྲ་མོས་བྱི་དོར་བྱ་བས་བྱི་དོར་བྱེད་དོ། །
en: Finally he rinses it in a great purifying liquid and polishes it with the finest cotton.

source: བྱི་དོར་བྱས་ཏེ་ནོར་བུ་མཆིང་བུའི་རིགས་དང་བྲལ་ནས་བཻ་དཱུརྱ་ཞེས་བྱའོ། །
en: Once he has polished it and separated it from the lesser quartz, it may thenceforth be called beryl.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་ཡོངས་སུ་མ་དག་པའི་སེམས་ཅན་གྱི་ཁམས་རིག་ནས་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་དང་། མི་སྡུག་པ་ཡིད་འབྱུང་བར་འགྱུར་བའི་གཏམ་གྱིས་འཁོར་བ་ལ་མངོན་པར་དགའ་བའི་སེམས་ཅན་རྣམས་ཡིད་འབྱུང་བར་བྱེད།
en: “In the same way, son of noble family, when the tathāgatas know the masses of completely impure beings, they cause beings who delight in saṃsāra to experience revulsion through discourses on impermanence, suffering, no self, and unattractiveness, which provoke revulsion.

source: འཕགས་པའི་ཆོས་འདུལ་བ་ལ་འཇུག་པར་བྱེད་དོ། །
en: Then, they cause them to enter the Dharma and Vinaya of the noble ones.

source: དེ་ཙམ་གྱིས་དེ་བཞིན་གཤེགས་པ་བརྩོན་འགྲུས་རྒྱུན་མི་གཅོད་ཅིང་།
en: But the efforts of the tathāgatas do not stop there.

source: དེའི་འོག་ཏུ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་གཏམ་གྱིས། དེ་བཞིན་གཤེགས་པའི་ཚུལ་ཁོང་དུ་ཆུད་པར་བྱེད་དོ། །
en: Next, they cause beings to comprehend the way of the tathāgatas through discourses on emptiness, signlessness, and wishlessness.

source: དེ་ཙམ་གྱིས་ཀྱང་དེ་བཞིན་གཤེགས་པ་བརྩོན་འགྲུས་རྒྱུན་མི་གཅོད་ཀྱི།
en: But the efforts of the tathāgatas do not stop there.

source: དེའི་འོག་ཏུ་ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལོའི་གཏམ་དང་། འཁོར་གསུམ་ཡོངས་སུ་དག་པའི་གཏམ་གྱིས་སེམས་ཅན་དེ་དག་དེ་བཞིན་གཤེགས་པའི་ཡུལ་ལ་འཛུད་དོ། །
en: Finally, they guide beings into the domain of the tathāgatas through discourses known as The Irreversible Wheel of the Dharma and The Purification of the Triple Sphere.

source: སེམས་ཅན་རྒྱུ་དང་། རང་བཞིན་སྣ་ཚོགས་པ་དེ་དག་མཉམ་དུ་ཞུགས་ནས་དེ་བཞིན་གཤེགས་པའི་ཆོས་ཉིད་ཁོང་དུ་ཆུད་པས་སྦྱིན་གནས་བླ་ན་མེད་པ་རྣམས་ཞེས་བྱའོ། །
en: Once beings with their various causes and natures have entered equality, they comprehend the true nature of the tathāgatas and may thenceforth be called unsurpassed recipients of generosity.

source: དེའི་ཕྱིར་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། ཀུན་གྱི་རྗེས་སུ་སོང་བ་དང་། ཐམས་ཅད་དུ་ཁ་ན་མ་ཐོ་བ་མེད་པ་དང་། དུས་གསུམ་གྱི་རྗེས་སུ་སོང་བ་དང་། དཀོན་མཆོག་གསུམ་གྱི་རིགས་རྒྱུན་མི་གཅོད་པ་རྣམ་གྲངས་འདིས་ཀྱང་འདི་ལྟར་རིག་པར་བྱ་སྟེ
en: “Therefore, son of noble family, you should understand by way of this exposition that tathāgata activity is inconceivable, universally applicable, flawless in every way, and attuned with the three times, and that it constitutes the unbroken continuity of the lineage of the Three Jewels.

source: དེ་བཞིན་གཤེགས་པ་ནི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་བསམ་གྱིས་མི་ཁྱབ་པ་དེ་ལ་ཡང་གནས་སོ། །
en: The tathāgatas abide in inconceivable tathāgata activity.

source: ནམ་མཁའི་རང་བཞིན་གྱི་ལུས་ཀྱང་མི་འདོར་རོ། །
en: They do not discard their space-like bodies.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུའང་སྟོན་ཏོ། །
en: They teach in all buddhafields.

source: བརྗོད་དུ་མེད་པའི་ཆོས་སྟོན་པའི་ཚིག་ཀྱང་མི་འདོར་རོ། །
en: They do not eschew words that communicate the inexpressible Dharma.

source: སྒྲ་ཇི་བཞིན་གྱི་རྣམ་པར་རིག་བྱེད་ཀྱིས་སེམས་ཅན་རྣམས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ། །
en: Rather, they teach the Dharma to sentient being by causing them to understand how things really are.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དམིགས་པ་དང་བྲལ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་བསམ་པ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know the minds of all beings to be without objectification, and they know the thoughts in their minds.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་བྱང་ཆུབ་སེམས་དཔའི་བསམ་པ་རྣམ་པར་དག་པར་བྱ་བའི་ཕྱིར་འབྱུང་ངོ་། །
en: The blessed buddhas appear in order to purify the bodhisattva intention.

source: རིགས་ཀྱི་བུ་གང་རྒྱུན་ཆད་པ་མེད་པ་རྒྱུན་ཆགས་པ། རྒྱུན་མི་གཅོད་པ། བྱང་ཆུབ་སེམས་དཔའ་ལུང་བསྟན་པའི་གཏམ་རྒྱུན་མི་གཅོད་པ་འདི་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་ཡང་དག་པའོ། །
en: “Son of noble family, this unceasing and uninterrupted continuity, this unbroken continuity, this unbroken continuity of discourses that prophesy bodhisattvas constitutes the tathāgata activity of the tathāgatas.”

source: དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་བསྟན་པ་འདི་བཤད་པ་ན་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་དཔག་ཏུ་མེད་པ། གྲངས་མེད་པ། བགྲང་བ་ལས་ཤིན་ཏུ་འདས་པ་དག་རྣམ་པ་དྲུག་ཏུ་གཡོས་པར་གྱུར་ཏོ། །
en: When this exposition of tathāgata activity had been delivered, the unfathomable, innumerable, and uncountable buddhafields of the ten directions shook six times.

source: སྣང་བ་ཆེན་པོས་ཀྱང་གསལ་བར་གྱུར་ཏོ། །མེ་ཏོག་གི་སིལ་མས་ཀྱང་གཏོར་བར་གྱུར་ཏོ། །
en: They shone brightly and were sprinkled with flower petals.

source: འཁོར་གྱི་ཁྱམས་རིན་པོ་ཆེ་བཀོད་པར་གཟི་བརྗིད་ཆེ་བ་གཟི་བརྗིད་ཆེ་བའི་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་། མི་མ་ཡིན་པ་དང་། དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་ཇི་སྙེད་འདུས་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་བསྟན་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ནས་ཚིམ་ཞིང་མགུ་སྟེ་ཡི་རངས་ནས་
en: When each and every one of the radiant and resplendent gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, mahoragas, humans, nonhumans, monks and nuns, and male and female lay practitioners who had assembled in the pavilion Jeweled Array heard the present Dharma discourse explaining tathāgata activity, they all grew content, pleased, and delighted.

source: དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ཆོས་གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་རྣམ་པ་སྣ་ཚོགས་རྣམས་
en: As an act of worship to the Tathāgata, they offered flowers, fragrance, incense, garlands, lotions, powders, religious robes, canopies, victory banners, and various types of draped banners.

source: སིལ་སྙན་དང་། ཕེག་རྡོབ་པ་དང་། གླུ་དབྱངས་བྱེད་པས་བཅོམ་ལྡན་འདས་རྣམས་མཆོད་དོ། །
en: They played cymbals and other musical instruments and sang melodious songs in veneration of the blessed ones.

source: དབུའི་གཙུག་ཏུ་མེ་ཏོག་རྣམས་ཀྱིས་ཀྱང་གཏོར་ཏོ། །
en: They scattered flowers over the crown of his head.

source: ཐིག་ལེ་ལྟ་བུའི་རྒྱན་དང་། རྣ་ཆ་དང་། དཔུང་རྒྱན་དང་། ནོར་བུའི་རྒྱན་ཕྲེང་དང་། མུ་ཏིག་གི་རྒྱན་ཕྲེང་དང་། རྒྱན་ཟླ་གམ་དང་། སྤེན་ཏོག་རྒྱན་དང་། རྒྱན་ནེའུ་ལེ་ཅན་དང་། སོར་གདུབ་རྒྱན་དང་། གདུ་བུ་རྒྱན་ཏ་ལ་འདབ་དང་། རྒྱན་ལྕམ་ཁྲིས་ཅན་དང་། སེ་རལ་ཕྲེང་དང་། རྐང་གདུབ་དང་། དོ་ཤལ་དང་། མགོ་རྒྱན་དང་། ལག་རྒྱན་དང་། རྣ་རྒྱན་དང་། རྐང་རྒྱན་རྣམས་ཀྱིས་ཀྱང་གཏོར་ཏོ། །
en: They sprinkled spherical ornaments, earrings, armlets, jewel necklaces, pearl necklaces, crescent-shaped adornments, muslin ornaments, mongoose decorations, rings, bangles, decorations shaped like the leaves of a tala tree, ornaments interwoven with flowers, shoulder ornaments, anklets, long necklaces, head ornaments, hand jewelry, and ornaments for the ears and feet.

source: རིན་པོ་ཆེ་བཻ་དཱུརྱ་དག་ཀྱང་གཏོར་ཏོ། །འཛམ་བུ་ཆུ་བོའི་གསེར་རིན་པོ་ཆེ་རྣམས་དང་། རིན་པོ་ཆེ་རྡོའི་སྙིང་པོ་རྣམས་དང་། རིན་པོ་ཆེ་དཔལ་གྱི་སྙིང་པོ་རྣམས་དང་། རིན་པོ་ཆེ་ཨན་ད་རྙིལ་རྣམས་དང་། རིན་པོ་ཆེ་མེ་མདོག་རྣམས་དང་། རིན་པོ་ཆེ་སྐར་འོད་རྣམས་དང་། རིན་པོ་ཆེ་ཁ་དོག་མཐའ་ཡས་རྣམས་ཀྱིས་ཀྱང་གཏོར་ཏོ། །
en: The assembly also spread out precious stones of beryl, gold from the Jambu River, precious stones of emerald, red gems, sapphires, fire-colored gems, gems with brilliant light, and multicolored gems.

source: གསེར་ཕྱེ་དང་། དངུལ་ཕྱེ་དང་། ཨ་ག་རུའི་ཕྱེ་མ་དང་། རྒྱ་སྤོས་ཀྱི་ཕྱེ་མ་དང་། ཙན་དན་གྱི་ཕྱེ་མ་དང་། ཙན་དན་དུས་ཀྱི་རྗེས་སུ་འབྲང་བའི་ཕྱེ་མ་དང་། ཙན་དན་དམར་པོའི་ཕྱེ་མ་དང་། ཀེ་ས་རའི་ཕྱེ་མ་རྣམས་ཀྱིས་ཀྱང་མངོན་པར་གཏོར་ཏོ། །
en: They scattered gold and silver dust as well as fragrant aloe powder, incense, sandalwood powder, benzoin powder, red sandalwood powder, and lotus powder.

source: ལྷའི་མེ་ཏོག་རྣམས་ཀྱང་མངོན་པར་གཏོར་བ་ལ་འདི་ལྟ་སྟེ། མེ་ཏོག་མན་དཱ་ར་བ་དང་། མན་དཱ་ར་བ་ཆེན་པོ་དང་། ཡོངས་འདུ་དང་། མན་ཛུ་ཥ་ཀ་དང་། མན་ཛུ་ཥ་ཀ་ཆེན་པོ་དང་། མདོག་མཛེས་དང་། མདོག་མཛེས་ཆེན་པོ་དང་། སྠ་ལ་དང་། སྠ་ལ་ཆེན་པོ་དང་། མེ་ཏོག་འཁོར་ལོ་དང་། འཁོར་ལོ་དྲི་མེད་དང་། འདབ་བརྒྱ་དང་། འདབ་སྟོང་དང་། འདབ་འབུམ་དང་། ཀུན་ནས་འོད་དང་། ཀུན་དུ་བསུང་དང་། ཀུན་དུ་ཆེར་སྣང་མིག་ཏུ་སྡུག་དང་། སྐར་འོད་དང་། འོད་བྱེད་དང་། ཁ་དོག་མཐའ་ཡས་དང་། མེ་ཏོག་དེ་ལྟ་བུ་དག་ཀྱང་མངོན་པར་གཏོར་ཏོ། །
en: They tossed celestial flowers, including different kinds of mandārava flowers, mahāmandārava flowers, coral-tree flowers, mañjūṣaka flowers, mahāmañjūṣaka flowers, roca flowers, mahāroca flowers, sthala flowers, mahāsthala flowers, cakra flowers, stainless cakra flowers, hundred-petaled lotus flowers, thousand-petaled lotus flowers, hundred-thousand-petaled lotus flowers, bright flowers, sweet-smelling flowers, exceedingly beautiful flowers, flowers resembling starlight, luminous flowers, multicolored flowers, and other similar flowers.

source: ཆུ་ནས་སྐྱེས་པའི་མེ་ཏོག་ཨུད་པ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་རྣམས་ཀྱང་གཏོར་ཏོ། །
en: They proceeded to scatter water-borne flowers, such as the blue lotus, lotus, water lily, and white lotus.

source: ཐང་ལས་སྐྱེས་པ་སྣ་མའི་མེ་ཏོག་དང་། པ་རི་ཥ་ཀ་དང་། ཨ་ཏི་མུག་ཏ་ཀ་དང་། ཙམ་པ་ཀ་དང་། མྱ་ངན་འཚང་དང་། དྷ་ནུ་སྐ་རི་དང་། སྐྱ་སྣར་དང་། མེ་ཏོག་བཏང་བཟུང་དག་ཀྱང་གཏོར་ཏོ། །
en: They scattered soil-grown flowers, such as jasmine flowers, pariṣaka flowers, flowers from the harimantha tree, magnolia flowers, aśoka flowers, dhanuskari flowers, pāṭala flowers, and flowers from the mucilinda tree.

source: སིལ་སྙན་དང་ཕེག་རྡོབ་པ་དག་ཀྱང་ཀུན་དུ་ཡང་དག་པར་སྦྱར་བ་ལ་འདི་ལྟ་སྟེ། ཕེག་རྡོབ་པ་དང་། གླིང་བུ་དང་། རྔ་བོ་ཆེ་དང་། དུང་དང་། རྫ་རྔ་དང་། འཁར་རྔ་དང་། སིལ་སྙན་དང་།
en: Finally, they played all kinds of musical instruments and drums, including small drums, flutes, bass drums, conches, kettle drums, gongs, and cymbals.

source: གླུ་དབྱངས་རྣམ་པ་སྣ་ཚོགས་ཀྱང་བྱས་སོ། །
en: They sang different kinds of melodious songs.

source: སྤོས་ཀྱི་ཆར་དང་། ཕྱེ་མའི་ཆར་དང་། རིན་པོ་ཆེའི་ཆར་དང་། རྒྱན་གྱི་ཆར་དང་། མུ་ཏིག་གི་རྒྱན་ཕྲེང་གི་ཆར་དང་། གོས་ཀྱི་ཆར་དང་། སིལ་སྙན་དང་། རོལ་མོའི་སྒྲའི་ཆར་ཡང་མངོན་པར་ཕབ་བོ། །
en: They rained down showers of incense, powders, jewelry, ornaments, pearl necklaces, and fine garments, along with the sounds of cymbals large and small.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་དག་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སྣ་ཚོགས་ནས་འདུས་པ་དེ་དག་སྟེང་གི་བར་སྣང་ལ་མངོན་པར་འཕགས་ཏེབཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་རང་རང་གི་ལུས་བོར་རོ། །
en: The bodhisattvas who had gathered from the various worlds of the ten directions rose into the sky above them and, as an act of worship to the Blessed One, sacrificed their own bodies.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་ལུས་བོར་མ་ཐག་ཏུ་དེ་ནས་སྟེང་གི་བར་སྣང་ལ་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་གྱི་ཁྱམས་རིན་པོ་ཆེ་བཀོད་པ་ཁེབས་པར་བྱས་ཏེ།
en: As soon as they had done so, they bedecked the entire pavilion Jeweled Array from the sky.

source: རིན་པོ་ཆེའི་དྲ་བ་མུ་ཏིག་གི་རྒྱན་ཕྲེང་དུ་མ་དཔྱངས་པ། ཀུན་ནས་མིག་མངས་རིས་སུ་བྲིས་པ། ཤིན་ཏུ་ཡོངས་སུ་ལས་སུ་བྱས་པ། དྲིལ་བུ་གཡེར་ཀའི་དྲ་བས་མཛེས་པར་བྱས་པ། རིན་པོ་ཆེའི་པད་མས་སྤྲས་པ་བྱུང་བར་གྱུར་ཏོ། །
en: It became embellished with many pearl necklaces arrayed as latticework of dangling jewels, decorated with checkered designs, carefully arranged, adorned with a net of small and large bells, and embellished with lotus flowers made of jewels.

source: མུ་ཏིག་གི་རྒྱན་ཕྲེང་དེ་དག་གི་མུ་ཏིག་གི་འབྲུ་རེ་རེ་ལས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་ལུས་དཔག་ཏུ་མེད་ཅིང་གྲངས་མེད་པ་དག་བྱུང་བར་ཀུན་དུ་སྣང་ངོ་། །དེ་དག་བྱུང་ནས་
en: From each individual pearl of those necklaces, unfathomably innumerable bodhisattva bodies emerged.

source: བཅོམ་ལྡན་འདས་ལ་ལན་བདུན་བསྐོར་བ་བྱས་ཏེརིན་པོ་ཆེ་བཀོད་པའི་པད་མའི་སེང་གེའི་ཁྲི་དེ་དག་ལ་འཁོད་དོ། །
en: They circumambulated the Blessed One seven times and sat down on lion thrones of lotus flowers with jeweled designs.

source: ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཚད་མེད་པ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཚད་མེད་པ་དག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་རེ་རེས་ཀྱང་བསྐལ་པར་བརྗོད་པ་ཡོངས་སུ་ཐུག་པ་མེད་པ་ཞེས་བྱ་བའི་མཆོད་པ་བཀོད་པ་བསྒྲུབས་ཏེ་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིར་བཏང་བ་དང་།
en: As an act of worship to this Dharma discourse, immeasurably many blessed buddhas from the immeasurably many buddhafields of the ten directions sent forth into the world realm Endurance arrays of offerings, accomplished by each tathāgata, known as free-flowing utterances lasting for eons.

source: སངས་རྒྱས་ཀྱི་མཐུས་བཀོད་པ་དེ་དག་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིར་ཕྱིན་ཏེདེ་དག་གིས་འཁོར་གྱི་ཁྱམས་རིན་པོ་ཆེ་བཀོད་པ་ལ་རྒྱན་གྱི་མཆོག་གིས་བརྒྱན་པར་གྱུར་ཏོ། །
en: Through the power of the Buddha these arrays arrived in this world realm Endurance and beautified the pavilion Jeweled Array with supreme embellishment.

source: འཁོར་འདི་ལས་སེམས་ཅན་ཚད་མེད་པ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་ཚད་མེད་པ་དག་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: From among this retinue, immeasurably many beings generated the mind of unsurpassed, complete and perfect awakening, and immeasurably many bodhisattvas attained acceptance of the nonorigination of phenomena.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཐམས་ཅད་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ལ་གླང་པོ་ཆེའི་ལྟ་སྟངས་ཀྱིས་གཟིགས་ནས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: At that point, the Blessed One surveyed the entire bodhisattva assembly with his elephantine gaze and said the following:

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་རྣམས་ལས་རྒྱན་བཀོད་པ་བསམ་གྱིས་མི་ཁྱབ་པ། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱིས་བྱིན་གྱིས་བརླབས་པ་དེ་བཞིན་གཤེགས་པས་བཏང་བ་རྣམ་པར་བརྟགས་པ་མ་ཡིན་པ། མ་འཁྲུགས་པ། མ་རྙིངས་པ། མ་ཉམས་པ་
en: “This inconceivable array of ornaments offered by you, noble beings, which is blessed by the bodhisattva’s meditative absorption and bestowed by the tathāgatas, is not constructed, is not disorderly, does not grow old, and does not deteriorate.
